In [ ]:
# ! pip install sqlalchemy
# ! pip install pymysql

In [21]:
import pandas as pd
from sqlalchemy import create_engine 
import pymysql.cursors
import os
import getpass
import urllib.parse

In [22]:
urllib.parse.quote_plus('!')

'%21'

In [23]:
urllib.parse.quote_plus('Ã©')

'%C3%A9'

In [24]:
pw_raw = os.getenv('sql')

In [25]:
pw = urllib.parse.quote_plus(pw_raw)

In [26]:
#engine = sqlalchemy.create_engine(f"mysql://{username}:{password}@{host}:{port}")

connection_string = 'mysql+pymysql://root:' + pw + '@localhost:3306/'
engine = create_engine(connection_string)

In [27]:
with engine.connect() as conn:
    conn.execute(f"CREATE DATABASE IF NOT EXISTS sakila")

In [8]:
df = pd.DataFrame({'Column1':[12,23,45]})

In [9]:
df

   Column1
0       12
1       23
2       45

In [10]:
df.to_sql('our_new_table',engine, 'a_new_db_412', if_exists='replace', index=False)

3

In [33]:
sql = """select *, month(rental_date) as month, year(rental_date) as year
from sakila.rental
group by rental_id"""

In [ ]:
rental_df = pd.read_sql_query(sql, engine)
rental_df

In [ ]:
# Write a Python function called rentals_month that retrieves rental data for 
# a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. 
# The function should take in three parameters:

# engine: an object representing the database connection engine to be used to establish 
# a connection to the Sakila database.
# month: an integer representing the month for which rental data is to be retrieved.
# year: an integer representing the year for which rental data is to be retrieved.
# The function should execute a SQL query to retrieve the rental data for the 
# specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

In [80]:
def rentals_month(engine, month, year):
    sql = f"""select *, month(rental_date) 'month', year(rental_date)'year'
    from sakila.rental
    where month(rental_date) = {month}
    and year(rental_date) = {year}
    """
    rental_df = pd.read_sql_query(sql, engine)
    return rental_df

In [81]:
rentals_month(engine,7,2005)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,month,year
0,3470,2005-07-05 22:49:24,883,565,2005-07-07 19:36:24,1,2006-02-15 21:30:53,7,2005
1,3471,2005-07-05 22:51:44,1724,242,2005-07-13 01:38:44,2,2006-02-15 21:30:53,7,2005
2,3472,2005-07-05 22:56:33,841,37,2005-07-13 17:18:33,2,2006-02-15 21:30:53,7,2005
3,3473,2005-07-05 22:57:34,2735,60,2005-07-12 23:53:34,1,2006-02-15 21:30:53,7,2005
4,3474,2005-07-05 22:59:53,97,594,2005-07-08 20:32:53,1,2006-02-15 21:30:53,7,2005
...,...,...,...,...,...,...,...,...,...
6704,10176,2005-07-31 23:40:35,1181,19,2005-08-09 00:46:35,2,2006-02-15 21:30:53,7,2005
6705,10177,2005-07-31 23:42:33,2242,279,2005-08-03 01:30:33,2,2006-02-15 21:30:53,7,2005
6706,10178,2005-07-31 23:43:04,1582,491,2005-08-03 00:43:04,1,2006-02-15 21:30:53,7,2005
6707,10179,2005-07-31 23:49:54,2136,131,2005-08-01 20:46:54,2,2006-02-15 21:30:53,7,2005
6708,10180,2005-07-31 23:57:43,757,50,2005-08-09 04:04:43,2,2006-02-15 21:30:53,7,2005

In [148]:
# Develop a Python function called rental_count_month that takes the DataFrame 
# provided by rentals_month as input along with the month and year and returns 
# a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.
# The function should also include the month and year as parameters and use them to name 
# the new column according to the month and year, for example, if the input month is 05 and the year is 2005, 
# the column name should be "rentals_05_2005".

# Hint: Consider making use of pandas groupby()
rentals_month(engine,7,2005)
def rental_count_month(engine, month, year):
    df = rentals_month(engine, f'{month}', f'{year}')
    serie_counts=df['customer_id'].value_counts()
    df1 = pd.DataFrame(serie_counts).reset_index()
    return df1

In [153]:
df2=rental_count_month(engine, 5, 2005)
df2

     customer_id  count
0            197      8
1            109      7
2            506      7
3            371      6
4            161      6
..           ...    ...
515          590      1
516          537      1
517          426      1
518          494      1
519           61      1

[520 rows x 2 columns]

In [ ]:
# Create a Python function called compare_rentals that takes two DataFrames as input 
# containing the number of rentals made by each customer in different months and years. 
# The function should return a combined DataFrame with a new 'difference' column, 
# which is the difference between the number of rentals in the two months.


def compare_rentals(engine,df2,df3)
    df2=

In [ ]:
new_df2 = pd.read_sql_table('payments',engine,'classicmodels')
new_df2